{
  "id": "t2",
  "title": "File permissions",
  "content": [
    "<h2>Overview</h2><p>File permissions focuses on read, write, execute bits and how to interpret them. This section keeps examples short and safe so you can build confidence.</p>",
    "<h2>Key ideas</h2><p>Keep these ideas in mind as you work with File permissions:</p><ul><li>Understand ownership, groups, and permission bits.</li><li>Make changes intentionally and verify with ls or stat.</li><li>Prefer safe editing and backups for critical files.</li></ul>",
    "<h2>Quick start</h2><p>Start with a minimal command and read the output carefully.</p><pre><code class=\"language-bash\">ls -l file.txt\n</code></pre><p>Run it twice so you can see the output change when the environment changes.</p>",
    "<h2>Example: everyday usage</h2><p>This example mirrors how you will use File permissions in daily work.</p><pre><code class=\"language-bash\">chmod u+rw file.txt\n</code></pre><p>Notice the order of flags and arguments.</p>",
    "<h2>Example: common flags</h2><p>Use flags to refine output and reduce noise.</p><pre><code class=\"language-bash\">chmod go-rwx file.txt\n</code></pre><p>Always check <code>--help</code> if a flag is unclear.</p>",
    "<h2>Example: working with paths</h2><p>Paths and filenames are the most common sources of mistakes.</p><pre><code class=\"language-bash\">umask\n</code></pre><p>Quote paths with spaces to avoid unexpected splits.</p>",
    "<h2>Example: verification</h2><p>Verify your work after each change to stay safe.</p><pre><code class=\"language-bash\">stat -c \"%A %a\" file.txt\n</code></pre><p>Get comfortable confirming state before moving on.</p>",
    "<h2>Pitfalls to avoid</h2><p>Go slowly and re-check the target when a command can change files or permissions. If you are unsure, run a read-only command first.</p>",
    "<h2>Practice checklist</h2><p>Try the following steps in a practice folder.</p><ol><li>Inspect permissions on a few files.</li><li>Change permissions on a practice file.</li><li>Restore or back up a file before editing.</li></ol>",
    "<h2>Real-world workflow</h2><p>Combine a short command, a verification step, and a quick note about the result. This habit keeps your work reproducible.</p>",
    "<h2>Recap</h2><p>You now have a reliable starting point for File permissions. Repeat the examples until the command patterns feel natural.</p>"
  ]
}
